// *********************************************************************************
// Keyboard.cpp
// *********************************************************************************

#include <stdio.h>
#include "numerical.h"

#include "Keyboard.h"

#define Button5 9

#include "AM_Define.h"


// -----------------------------------------------------------------------------
// キーボード初期化
// -----------------------------------------------------------------------------
void initKeyboard()
{
  Keyboard.begin();
}

// -----------------------------------------------------------------------------
// キーボード処理
// -----------------------------------------------------------------------------
void cmdKeyboard(const Uint8 *Cmd ,Sint16 len)
{
	Sint16 remind;
	const Uint8 *curr = &Cmd[2];
	const Uint8 *pend;
	
	if(len <= 2){
		return;
	}
	
	pend = Cmd + Cmd[1];
	while(curr != pend){		
		Keyboard.write(*curr);		
		curr++;
	}
}
